skeleton/app/controllers/api/entries_controller.rb

SELECT "entries".* FROM "entries" WHERE "entries"."feed_id" IN (1)
SELECT "feeds".* FROM "feeds" WHERE "feeds"."id" = $1 LIMIT 1  [["id", "1"]]
---
  def index
    feed = Feed.includes(:entries).find(params[:feed_id])